GopalSaraf/Practicals/PSDL/include/proc/pic16f1769.inc
// Register: LATA
#define LATA LATA
LATA                                     equ 010Ch
// bitfield definitions
LATA_LATA0_POSN                          equ 0000h
LATA_LATA0_POSITION                      equ 0000h
LATA_LATA0_SIZE                          equ 0001h
LATA_LATA0_LENGTH                        equ 0001h
LATA_LATA0_MASK                          equ 0001h
LATA_LATA1_POSN                          equ 0001h
LATA_LATA1_POSITION                      equ 0001h
LATA_LATA1_SIZE                          equ 0001h
LATA_LATA1_LENGTH                        equ 0001h
LATA_LATA1_MASK                          equ 0002h
LATA_LATA2_POSN                          equ 0002h
LATA_LATA2_POSITION                      equ 0002h
LATA_LATA2_SIZE                          equ 0001h
LATA_LATA2_LENGTH                        equ 0001h
LATA_LATA2_MASK                          equ 0004h
LATA_LATA4_POSN                          equ 0004h
LATA_LATA4_POSITION                      equ 0004h
LATA_LATA4_SIZE                          equ 0001h
LATA_LATA4_LENGTH                        equ 0001h
LATA_LATA4_MASK                          equ 0010h
LATA_LATA5_POSN                          equ 0005h
LATA_LATA5_POSITION                      equ 0005h
LATA_LATA5_SIZE                          equ 0001h
LATA_LATA5_LENGTH                        equ 0001h
LATA_LATA5_MASK                          equ 0020h

// Register: LATB
#define LATB LATB
LATB                                     equ 010Dh
// bitfield definitions
LATB_LATB4_POSN                          equ 0004h
LATB_LATB4_POSITION                      equ 0004h
LATB_LATB4_SIZE                          equ 0001h
LATB_LATB4_LENGTH                        equ 0001h
LATB_LATB4_MASK                          equ 0010h
LATB_LATB5_POSN                          equ 0005h
LATB_LATB5_POSITION                      equ 0005h
LATB_LATB5_SIZE                          equ 0001h
LATB_LATB5_LENGTH                        equ 0001h
LATB_LATB5_MASK                          equ 0020h
LATB_LATB6_POSN                          equ 0006h
LATB_LATB6_POSITION                      equ 0006h
LATB_LATB6_SIZE                          equ 0001h
LATB_LATB6_LENGTH                        equ 0001h
LATB_LATB6_MASK                          equ 0040h
LATB_LATB7_POSN                          equ 0007h
LATB_LATB7_POSITION                      equ 0007h
LATB_LATB7_SIZE                          equ 0001h
LATB_LATB7_LENGTH                        equ 0001h
LATB_LATB7_MASK                          equ 0080h

// Register: LATC
#define LATC LATC
LATC                                     equ 010Eh
// bitfield definitions
LATC_LATC0_POSN                          equ 0000h
LATC_LATC0_POSITION                      equ 0000h
LATC_LATC0_SIZE                          equ 0001h
LATC_LATC0_LENGTH                        equ 0001h
LATC_LATC0_MASK                          equ 0001h
LATC_LATC1_POSN                          equ 0001h
LATC_LATC1_POSITION                      equ 0001h
LATC_LATC1_SIZE                          equ 0001h
LATC_LATC1_LENGTH                        equ 0001h
LATC_LATC1_MASK                          equ 0002h
LATC_LATC2_POSN                          equ 0002h
LATC_LATC2_POSITION                      equ 0002h
LATC_LATC2_SIZE                          equ 0001h
LATC_LATC2_LENGTH                        equ 0001h
LATC_LATC2_MASK                          equ 0004h
LATC_LATC3_POSN                          equ 0003h
LATC_LATC3_POSITION                      equ 0003h
LATC_LATC3_SIZE                          equ 0001h
LATC_LATC3_LENGTH                        equ 0001h
LATC_LATC3_MASK                          equ 0008h
LATC_LATC4_POSN                          equ 0004h
LATC_LATC4_POSITION                      equ 0004h
LATC_LATC4_SIZE                          equ 0001h
LATC_LATC4_LENGTH                        equ 0001h
LATC_LATC4_MASK                          equ 0010h
LATC_LATC5_POSN                          equ 0005h
LATC_LATC5_POSITION                      equ 0005h
LATC_LATC5_SIZE                          equ 0001h
LATC_LATC5_LENGTH                        equ 0001h
LATC_LATC5_MASK                          equ 0020h
LATC_LATC6_POSN                          equ 0006h
LATC_LATC6_POSITION                      equ 0006h
LATC_LATC6_SIZE                          equ 0001h
LATC_LATC6_LENGTH                        equ 0001h
LATC_LATC6_MASK                          equ 0040h
LATC_LATC7_POSN                          equ 0007h
LATC_LATC7_POSITION                      equ 0007h
LATC_LATC7_SIZE                          equ 0001h
LATC_LATC7_LENGTH                        equ 0001h
LATC_LATC7_MASK                          equ 0080h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 010Fh
// bitfield definitions
CMOUT_MC1OUT_POSN                        equ 0000h
CMOUT_MC1OUT_POSITION                    equ 0000h
CMOUT_MC1OUT_SIZE                        equ 0001h
CMOUT_MC1OUT_LENGTH                      equ 0001h
CMOUT_MC1OUT_MASK                        equ 0001h
CMOUT_MC2OUT_POSN                        equ 0001h
CMOUT_MC2OUT_POSITION                    equ 0001h
CMOUT_MC2OUT_SIZE                        equ 0001h
CMOUT_MC2OUT_LENGTH                      equ 0001h
CMOUT_MC2OUT_MASK                        equ 0002h
CMOUT_MC3OUT_POSN                        equ 0002h
CMOUT_MC3OUT_POSITION                    equ 0002h
CMOUT_MC3OUT_SIZE                        equ 0001h
CMOUT_MC3OUT_LENGTH                      equ 0001h
CMOUT_MC3OUT_MASK                        equ 0004h
CMOUT_MC4OUT_POSN                        equ 0003h
CMOUT_MC4OUT_POSITION                    equ 0003h
CMOUT_MC4OUT_SIZE                        equ 0001h
CMOUT_MC4OUT_LENGTH                      equ 0001h
CMOUT_MC4OUT_MASK                        equ 0008h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0110h
// bitfield definitions
CM1CON0_SYNC_POSN                        equ 0000h
CM1CON0_SYNC_POSITION                    equ 0000h
CM1CON0_SYNC_SIZE                        equ 0001h
CM1CON0_SYNC_LENGTH                      equ 0001h
CM1CON0_SYNC_MASK                        equ 0001h
CM1CON0_HYS_POSN                         equ 0001h
CM1CON0_HYS_POSITION                     equ 0001h
CM1CON0_HYS_SIZE                         equ 0001h
CM1CON0_HYS_LENGTH                       equ 0001h
CM1CON0_HYS_MASK                         equ 0002h
CM1CON0_ZLF_POSN                         equ 0003h
CM1CON0_ZLF_POSITION                     equ 0003h
CM1CON0_ZLF_SIZE                         equ 0001h
CM1CON0_ZLF_LENGTH                       equ 0001h
CM1CON0_ZLF_MASK                         equ 0008h
CM1CON0_POL_POSN                         equ 0004h
CM1CON0_POL_POSITION                     equ 0004h
CM1CON0_POL_SIZE                         equ 0001h
CM1CON0_POL_LENGTH                       equ 0001h
CM1CON0_POL_MASK                         equ 0010h
CM1CON0_OUT_POSN                         equ 0006h
CM1CON0_OUT_POSITION                     equ 0006h
CM1CON0_OUT_SIZE                         equ 0001h
CM1CON0_OUT_LENGTH                       equ 0001h
CM1CON0_OUT_MASK                         equ 0040h
CM1CON0_ON_POSN                          equ 0007h
CM1CON0_ON_POSITION                      equ 0007h
CM1CON0_ON_SIZE                          equ 0001h
CM1CON0_ON_LENGTH                        equ 0001h
CM1CON0_ON_MASK                          equ 0080h
CM1CON0_C1SYNC_POSN                      equ 0000h
CM1CON0_C1SYNC_POSITION                  equ 0000h
CM1CON0_C1SYNC_SIZE                      equ 0001h
CM1CON0_C1SYNC_LENGTH                    equ 0001h
CM1CON0_C1SYNC_MASK                      equ 0001h
CM1CON0_C1HYS_POSN                       equ 0001h
CM1CON0_C1HYS_POSITION                   equ 0001h
CM1CON0_C1HYS_SIZE                       equ 0001h
CM1CON0_C1HYS_LENGTH                     equ 0001h
CM1CON0_C1HYS_MASK                       equ 0002h
CM1CON0_C1SP_POSN                        equ 0002h
CM1CON0_C1SP_POSITION                    equ 0002h
CM1CON0_C1SP_SIZE                        equ 0001h
CM1CON0_C1SP_LENGTH                      equ 0001h
CM1CON0_C1SP_MASK                        equ 0004h
CM1CON0_C1ZLF_POSN                       equ 0003h
CM1CON0_C1ZLF_POSITION                   equ 0003h
CM1CON0_C1ZLF_SIZE                       equ 0001h
CM1CON0_C1ZLF_LENGTH                     equ 0001h
CM1CON0_C1ZLF_MASK                       equ 0008h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1ON_POSN                        equ 0007h
CM1CON0_C1ON_POSITION                    equ 0007h
CM1CON0_C1ON_SIZE                        equ 0001h
CM1CON0_C1ON_LENGTH                      equ 0001h
CM1CON0_C1ON_MASK                        equ 0080h

// Register: CM1CON1
#define CM1CON1 CM1CON1
CM1CON1                                  equ 0111h
// bitfield definitions
CM1CON1_INTN_POSN                        equ 0000h
CM1CON1_INTN_POSITION                    equ 0000h
CM1CON1_INTN_SIZE                        equ 0001h
CM1CON1_INTN_LENGTH                      equ 0001h
CM1CON1_INTN_MASK                        equ 0001h
CM1CON1_INTP_POSN                        equ 0001h
CM1CON1_INTP_POSITION                    equ 0001h
CM1CON1_INTP_SIZE                        equ 0001h
CM1CON1_INTP_LENGTH                      equ 0001h
CM1CON1_INTP_MASK                        equ 0002h
CM1CON1_C1INTN_POSN                      equ 0000h
CM1CON1_C1INTN_POSITION                  equ 0000h
CM1CON1_C1INTN_SIZE                      equ 0001h
CM1CON1_C1INTN_LENGTH                    equ 0001h
CM1CON1_C1INTN_MASK                      equ 0001h
CM1CON1_C1INTP_POSN                      equ 0001h
CM1CON1_C1INTP_POSITION                  equ 0001h
CM1CON1_C1INTP_SIZE                      equ 0001h
CM1CON1_C1INTP_LENGTH                    equ 0001h
CM1CON1_C1INTP_MASK                      equ 0002h

// Register: CM1NSEL
#define CM1NSEL CM1NSEL
CM1NSEL                                  equ 0112h
// bitfield definitions
CM1NSEL_NCH_POSN                         equ 0000h
CM1NSEL_NCH_POSITION                     equ 0000h
CM1NSEL_NCH_SIZE                         equ 0003h
CM1NSEL_NCH_LENGTH                       equ 0003h
CM1NSEL_NCH_MASK                         equ 0007h
CM1NSEL_NCH0_POSN                        equ 0000h
CM1NSEL_NCH0_POSITION                    equ 0000h
CM1NSEL_NCH0_SIZE                        equ 0001h
CM1NSEL_NCH0_LENGTH                      equ 0001h
CM1NSEL_NCH0_MASK                        equ 0001h
CM1NSEL_NCH1_POSN                        equ 0001h
CM1NSEL_NCH1_POSITION                    equ 0001h
CM1NSEL_NCH1_SIZE                        equ 0001h
CM1NSEL_NCH1_LENGTH                      equ 0001h
CM1NSEL_NCH1_MASK                        equ 0002h
CM1NSEL_NCH2_POSN                        equ 0002h
CM1NSEL_NCH2_POSITION                    equ 0002h
CM1NSEL_NCH2_SIZE                        equ 0001h
CM1NSEL_NCH2_LENGTH                      equ 0001h
CM1NSEL_NCH2_MASK                        equ 0004h
CM1NSEL_C1NCH_POSN                       equ 0000h
CM1NSEL_C1NCH_POSITION                   equ 0000h
CM1NSEL_C1NCH_SIZE                       equ 0003h
CM1NSEL_C1NCH_LENGTH                     equ 0003h
CM1NSEL_C1NCH_MASK                       equ 0007h
CM1NSEL_C1NCH0_POSN                      equ 0000h
CM1NSEL_C1NCH0_POSITION                  equ 0000h
CM1NSEL_C1NCH0_SIZE                      equ 0001h
CM1NSEL_C1NCH0_LENGTH                    equ 0001h
CM1NSEL_C1NCH0_MASK                      equ 0001h
CM1NSEL_C1NCH1_POSN                      equ 0001h
CM1NSEL_C1NCH1_POSITION                  equ 0001h
CM1NSEL_C1NCH1_SIZE                      equ 0001h
CM1NSEL_C1NCH1_LENGTH                    equ 0001h
CM1NSEL_C1NCH1_MASK                      equ 0002h
CM1NSEL_C1NCH2_POSN                      equ 0002h
CM1NSEL_C1NCH2_POSITION                  equ 0002h
CM1NSEL_C1NCH2_SIZE                      equ 0001h
CM1NSEL_C1NCH2_LENGTH                    equ 0001h
CM1NSEL_C1NCH2_MASK                      equ 0004h

// Register: CM1PSEL
#define CM1PSEL CM1PSEL
CM1PSEL                                  equ 0113h
// bitfield definitions
CM1PSEL_PCH_POSN                         equ 0000h
CM1PSEL_PCH_POSITION                     equ 0000h
CM1PSEL_PCH_SIZE                         equ 0004h
CM1PSEL_PCH_LENGTH                       equ 0004h
CM1PSEL_PCH_MASK                         equ 000Fh
CM1PSEL_PCH0_POSN                        equ 0000h
CM1PSEL_PCH0_POSITION                    equ 0000h
CM1PSEL_PCH0_SIZE                        equ 0001h
CM1PSEL_PCH0_LENGTH                      equ 0001h
CM1PSEL_PCH0_MASK                        equ 0001h
CM1PSEL_PCH1_POSN                        equ 0001h
CM1PSEL_PCH1_POSITION                    equ 0001h
CM1PSEL_PCH1_SIZE                        equ 0001h
CM1PSEL_PCH1_LENGTH                      equ 0001h
CM1PSEL_PCH1_MASK                        equ 0002h
CM1PSEL_PCH2_POSN                        equ 0002h
CM1PSEL_PCH2_POSITION                    equ 0002h
CM1PSEL_PCH2_SIZE                        equ 0001h
CM1PSEL_PCH2_LENGTH                      equ 0001h
CM1PSEL_PCH2_MASK                        equ 0004h
CM1PSEL_PCH3_POSN                        equ 0003h
CM1PSEL_PCH3_POSITION                    equ 0003h
CM1PSEL_PCH3_SIZE                        equ 0001h
CM1PSEL_PCH3_LENGTH                      equ 0001h
CM1PSEL_PCH3_MASK                        equ 0008h
CM1PSEL_C1PCH_POSN                       equ 0000h
CM1PSEL_C1PCH_POSITION                   equ 0000h
CM1PSEL_C1PCH_SIZE                       equ 0004h
CM1PSEL_C1PCH_LENGTH                     equ 0004h
CM1PSEL_C1PCH_MASK                       equ 000Fh
CM1PSEL_C1PCH0_POSN                      equ 0000h
CM1PSEL_C1PCH0_POSITION                  equ 0000h
CM1PSEL_C1PCH0_SIZE                      equ 0001h
CM1PSEL_C1PCH0_LENGTH                    equ 0001h
CM1PSEL_C1PCH0_MASK                      equ 0001h
CM1PSEL_C1PCH1_POSN                      equ 0001h
CM1PSEL_C1PCH1_POSITION                  equ 0001h
CM1PSEL_C1PCH1_SIZE                      equ 0001h
CM1PSEL_C1PCH1_LENGTH                    equ 0001h
CM1PSEL_C1PCH1_MASK                      equ 0002h
CM1PSEL_C1PCH2_POSN                      equ 0002h
CM1PSEL_C1PCH2_POSITION                  equ 0002h
CM1PSEL_C1PCH2_SIZE                      equ 0001h
CM1PSEL_C1PCH2_LENGTH                    equ 0001h
CM1PSEL_C1PCH2_MASK                      equ 0004h
CM1PSEL_C1PCH3_POSN                      equ 0003h
CM1PSEL_C1PCH3_POSITION                  equ 0003h
CM1PSEL_C1PCH3_SIZE                      equ 0001h
CM1PSEL_C1PCH3_LENGTH                    equ 0001h
CM1PSEL_C1PCH3_MASK                      equ 0008h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0114h
// bitfield definitions
CM2CON0_SYNC_POSN                        equ 0000h
CM2CON0_SYNC_POSITION                    equ 0000h
CM2CON0_SYNC_SIZE                        equ 0001h
CM2CON0_SYNC_LENGTH                      equ 0001h
CM2CON0_SYNC_MASK                        equ 0001h
CM2CON0_HYS_POSN                         equ 0001h
CM2CON0_HYS_POSITION                     equ 0001h
CM2CON0_HYS_SIZE                         equ 0001h
CM2CON0_HYS_LENGTH                       equ 0001h
CM2CON0_HYS_MASK                         equ 0002h
CM2CON0_ZLF_POSN                         equ 0003h
CM2CON0_ZLF_POSITION                     equ 0003h
CM2CON0_ZLF_SIZE                         equ 0001h
CM2CON0_ZLF_LENGTH                       equ 0001h
CM2CON0_ZLF_MASK                         equ 0008h
CM2CON0_POL_POSN                         equ 0004h
CM2CON0_POL_POSITION                     equ 0004h
CM2CON0_POL_SIZE                         equ 0001h
CM2CON0_POL_LENGTH                       equ 0001h
CM2CON0_POL_MASK                         equ 0010h
CM2CON0_OUT_POSN                         equ 0006h
CM2CON0_OUT_POSITION                     equ 0006h
CM2CON0_OUT_SIZE                         equ 0001h
CM2CON0_OUT_LENGTH                       equ 0001h
CM2CON0_OUT_MASK                         equ 0040h
CM2CON0_ON_POSN                          equ 0007h
CM2CON0_ON_POSITION                      equ 0007h
CM2CON0_ON_SIZE                          equ 0001h
CM2CON0_ON_LENGTH                        equ 0001h
CM2CON0_ON_MASK                          equ 0080h
CM2CON0_C2SYNC_POSN                      equ 0000h
CM2CON0_C2SYNC_POSITION                  equ 0000h
CM2CON0_C2SYNC_SIZE                      equ 0001h
CM2CON0_C2SYNC_LENGTH                    equ 0001h
CM2CON0_C2SYNC_MASK                      equ 0001h
CM2CON0_C2HYS_POSN                       equ 0001h
CM2CON0_C2HYS_POSITION                   equ 0001h
CM2CON0_C2HYS_SIZE                       equ 0001h
CM2CON0_C2HYS_LENGTH                     equ 0001h
CM2CON0_C2HYS_MASK                       equ 0002h
CM2CON0_C2SP_POSN                        equ 0002h
CM2CON0_C2SP_POSITION                    equ 0002h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0004h
CM2CON0_C2ZLF_POSN                       equ 0003h
CM2CON0_C2ZLF_POSITION                   equ 0003h
CM2CON0_C2ZLF_SIZE                       equ 0001h
CM2CON0_C2ZLF_LENGTH                     equ 0001h
CM2CON0_C2ZLF_MASK                       equ 0008h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0115h
// bitfield definitions
CM2CON1_INTN_POSN                        equ 0000h
CM2CON1_INTN_POSITION                    equ 0000h
CM2CON1_INTN_SIZE                        equ 0001h
CM2CON1_INTN_LENGTH                      equ 0001h
CM2CON1_INTN_MASK                        equ 0001h
CM2CON1_INTP_POSN                        equ 0001h
CM2CON1_INTP_POSITION                    equ 0001h
CM2CON1_INTP_SIZE                        equ 0001h
CM2CON1_INTP_LENGTH                      equ 0001h
CM2CON1_INTP_MASK                        equ 0002h
CM2CON1_C2INTN_POSN                      equ 0000h
CM2CON1_C2INTN_POSITION                  equ 0000h
CM2CON1_C2INTN_SIZE                      equ 0001h
CM2CON1_C2INTN_LENGTH                    equ 0001h
CM2CON1_C2INTN_MASK                      equ 0001h
CM2CON1_C2INTP_POSN                      equ 0001h
CM2CON1_C2INTP_POSITION                  equ 0001h
CM2CON1_C2INTP_SIZE                      equ 0001h
CM2CON1_C2INTP_LENGTH                    equ 0001h
CM2CON1_C2INTP_MASK                      equ 0002h

// Register: CM2NSEL
#define CM2NSEL CM2NSEL
CM2NSEL                                  equ 0116h
// bitfield definitions
CM2NSEL_NCH_POSN                         equ 0000h
CM2NSEL_NCH_POSITION                     equ 0000h
CM2NSEL_NCH_SIZE                         equ 0003h
CM2NSEL_NCH_LENGTH                       equ 0003h
CM2NSEL_NCH_MASK                         equ 0007h
CM2NSEL_NCH0_POSN                        equ 0000h
CM2NSEL_NCH0_POSITION                    equ 0000h
CM2NSEL_NCH0_SIZE                        equ 0001h
CM2NSEL_NCH0_LENGTH                      equ 0001h
CM2NSEL_NCH0_MASK                        equ 0001h
CM2NSEL_NCH1_POSN                        equ 0001h
CM2NSEL_NCH1_POSITION                    equ 0001h
CM2NSEL_NCH1_SIZE                        equ 0001h
CM2NSEL_NCH1_LENGTH                      equ 0001h
CM2NSEL_NCH1_MASK                        equ 0002h
CM2NSEL_NCH2_POSN                        equ 0002h
CM2NSEL_NCH2_POSITION                    equ 0002h
CM2NSEL_NCH2_SIZE                        equ 0001h
CM2NSEL_NCH2_LENGTH                      equ 0001h
CM2NSEL_NCH2_MASK                        equ 0004h
CM2NSEL_C2NCH_POSN                       equ 0000h
CM2NSEL_C2NCH_POSITION                   equ 0000h
CM2NSEL_C2NCH_SIZE                       equ 0003h
CM2NSEL_C2NCH_LENGTH                     equ 0003h
CM2NSEL_C2NCH_MASK                       equ 0007h
CM2NSEL_C2NCH0_POSN                      equ 0000h
CM2NSEL_C2NCH0_POSITION                  equ 0000h
CM2NSEL_C2NCH0_SIZE                      equ 0001h
CM2NSEL_C2NCH0_LENGTH                    equ 0001h
CM2NSEL_C2NCH0_MASK                      equ 0001h
CM2NSEL_C2NCH1_POSN                      equ 0001h
CM2NSEL_C2NCH1_POSITION                  equ 0001h
CM2NSEL_C2NCH1_SIZE                      equ 0001h
CM2NSEL_C2NCH1_LENGTH                    equ 0001h
CM2NSEL_C2NCH1_MASK                      equ 0002h
CM2NSEL_C2NCH2_POSN                      equ 0002h
CM2NSEL_C2NCH2_POSITION                  equ 0002h
CM2NSEL_C2NCH2_SIZE                      equ 0001h
CM2NSEL_C2NCH2_LENGTH                    equ 0001h
CM2NSEL_C2NCH2_MASK                      equ 0004h

