GopalSaraf/Practicals/PSDL/include/proc/pic16f1769.inc
// Register: CM2PSEL
#define CM2PSEL CM2PSEL
CM2PSEL                                  equ 0117h
// bitfield definitions
CM2PSEL_PCH_POSN                         equ 0000h
CM2PSEL_PCH_POSITION                     equ 0000h
CM2PSEL_PCH_SIZE                         equ 0004h
CM2PSEL_PCH_LENGTH                       equ 0004h
CM2PSEL_PCH_MASK                         equ 000Fh
CM2PSEL_PCH0_POSN                        equ 0000h
CM2PSEL_PCH0_POSITION                    equ 0000h
CM2PSEL_PCH0_SIZE                        equ 0001h
CM2PSEL_PCH0_LENGTH                      equ 0001h
CM2PSEL_PCH0_MASK                        equ 0001h
CM2PSEL_PCH1_POSN                        equ 0001h
CM2PSEL_PCH1_POSITION                    equ 0001h
CM2PSEL_PCH1_SIZE                        equ 0001h
CM2PSEL_PCH1_LENGTH                      equ 0001h
CM2PSEL_PCH1_MASK                        equ 0002h
CM2PSEL_PCH2_POSN                        equ 0002h
CM2PSEL_PCH2_POSITION                    equ 0002h
CM2PSEL_PCH2_SIZE                        equ 0001h
CM2PSEL_PCH2_LENGTH                      equ 0001h
CM2PSEL_PCH2_MASK                        equ 0004h
CM2PSEL_PCH3_POSN                        equ 0003h
CM2PSEL_PCH3_POSITION                    equ 0003h
CM2PSEL_PCH3_SIZE                        equ 0001h
CM2PSEL_PCH3_LENGTH                      equ 0001h
CM2PSEL_PCH3_MASK                        equ 0008h
CM2PSEL_C2PCH_POSN                       equ 0000h
CM2PSEL_C2PCH_POSITION                   equ 0000h
CM2PSEL_C2PCH_SIZE                       equ 0004h
CM2PSEL_C2PCH_LENGTH                     equ 0004h
CM2PSEL_C2PCH_MASK                       equ 000Fh
CM2PSEL_C2PCH0_POSN                      equ 0000h
CM2PSEL_C2PCH0_POSITION                  equ 0000h
CM2PSEL_C2PCH0_SIZE                      equ 0001h
CM2PSEL_C2PCH0_LENGTH                    equ 0001h
CM2PSEL_C2PCH0_MASK                      equ 0001h
CM2PSEL_C2PCH1_POSN                      equ 0001h
CM2PSEL_C2PCH1_POSITION                  equ 0001h
CM2PSEL_C2PCH1_SIZE                      equ 0001h
CM2PSEL_C2PCH1_LENGTH                    equ 0001h
CM2PSEL_C2PCH1_MASK                      equ 0002h
CM2PSEL_C2PCH2_POSN                      equ 0002h
CM2PSEL_C2PCH2_POSITION                  equ 0002h
CM2PSEL_C2PCH2_SIZE                      equ 0001h
CM2PSEL_C2PCH2_LENGTH                    equ 0001h
CM2PSEL_C2PCH2_MASK                      equ 0004h
CM2PSEL_C2PCH3_POSN                      equ 0003h
CM2PSEL_C2PCH3_POSITION                  equ 0003h
CM2PSEL_C2PCH3_SIZE                      equ 0001h
CM2PSEL_C2PCH3_LENGTH                    equ 0001h
CM2PSEL_C2PCH3_MASK                      equ 0008h

// Register: CM3CON0
#define CM3CON0 CM3CON0
CM3CON0                                  equ 0118h
// bitfield definitions
CM3CON0_SYNC_POSN                        equ 0000h
CM3CON0_SYNC_POSITION                    equ 0000h
CM3CON0_SYNC_SIZE                        equ 0001h
CM3CON0_SYNC_LENGTH                      equ 0001h
CM3CON0_SYNC_MASK                        equ 0001h
CM3CON0_HYS_POSN                         equ 0001h
CM3CON0_HYS_POSITION                     equ 0001h
CM3CON0_HYS_SIZE                         equ 0001h
CM3CON0_HYS_LENGTH                       equ 0001h
CM3CON0_HYS_MASK                         equ 0002h
CM3CON0_ZLF_POSN                         equ 0003h
CM3CON0_ZLF_POSITION                     equ 0003h
CM3CON0_ZLF_SIZE                         equ 0001h
CM3CON0_ZLF_LENGTH                       equ 0001h
CM3CON0_ZLF_MASK                         equ 0008h
CM3CON0_POL_POSN                         equ 0004h
CM3CON0_POL_POSITION                     equ 0004h
CM3CON0_POL_SIZE                         equ 0001h
CM3CON0_POL_LENGTH                       equ 0001h
CM3CON0_POL_MASK                         equ 0010h
CM3CON0_OUT_POSN                         equ 0006h
CM3CON0_OUT_POSITION                     equ 0006h
CM3CON0_OUT_SIZE                         equ 0001h
CM3CON0_OUT_LENGTH                       equ 0001h
CM3CON0_OUT_MASK                         equ 0040h
CM3CON0_ON_POSN                          equ 0007h
CM3CON0_ON_POSITION                      equ 0007h
CM3CON0_ON_SIZE                          equ 0001h
CM3CON0_ON_LENGTH                        equ 0001h
CM3CON0_ON_MASK                          equ 0080h
CM3CON0_C3SYNC_POSN                      equ 0000h
CM3CON0_C3SYNC_POSITION                  equ 0000h
CM3CON0_C3SYNC_SIZE                      equ 0001h
CM3CON0_C3SYNC_LENGTH                    equ 0001h
CM3CON0_C3SYNC_MASK                      equ 0001h
CM3CON0_C3HYS_POSN                       equ 0001h
CM3CON0_C3HYS_POSITION                   equ 0001h
CM3CON0_C3HYS_SIZE                       equ 0001h
CM3CON0_C3HYS_LENGTH                     equ 0001h
CM3CON0_C3HYS_MASK                       equ 0002h
CM3CON0_C3SP_POSN                        equ 0002h
CM3CON0_C3SP_POSITION                    equ 0002h
CM3CON0_C3SP_SIZE                        equ 0001h
CM3CON0_C3SP_LENGTH                      equ 0001h
CM3CON0_C3SP_MASK                        equ 0004h
CM3CON0_C3ZLF_POSN                       equ 0003h
CM3CON0_C3ZLF_POSITION                   equ 0003h
CM3CON0_C3ZLF_SIZE                       equ 0001h
CM3CON0_C3ZLF_LENGTH                     equ 0001h
CM3CON0_C3ZLF_MASK                       equ 0008h
CM3CON0_C3POL_POSN                       equ 0004h
CM3CON0_C3POL_POSITION                   equ 0004h
CM3CON0_C3POL_SIZE                       equ 0001h
CM3CON0_C3POL_LENGTH                     equ 0001h
CM3CON0_C3POL_MASK                       equ 0010h
CM3CON0_C3OUT_POSN                       equ 0006h
CM3CON0_C3OUT_POSITION                   equ 0006h
CM3CON0_C3OUT_SIZE                       equ 0001h
CM3CON0_C3OUT_LENGTH                     equ 0001h
CM3CON0_C3OUT_MASK                       equ 0040h
CM3CON0_C3ON_POSN                        equ 0007h
CM3CON0_C3ON_POSITION                    equ 0007h
CM3CON0_C3ON_SIZE                        equ 0001h
CM3CON0_C3ON_LENGTH                      equ 0001h
CM3CON0_C3ON_MASK                        equ 0080h

// Register: CM3CON1
#define CM3CON1 CM3CON1
CM3CON1                                  equ 0119h
// bitfield definitions
CM3CON1_INTN_POSN                        equ 0000h
CM3CON1_INTN_POSITION                    equ 0000h
CM3CON1_INTN_SIZE                        equ 0001h
CM3CON1_INTN_LENGTH                      equ 0001h
CM3CON1_INTN_MASK                        equ 0001h
CM3CON1_INTP_POSN                        equ 0001h
CM3CON1_INTP_POSITION                    equ 0001h
CM3CON1_INTP_SIZE                        equ 0001h
CM3CON1_INTP_LENGTH                      equ 0001h
CM3CON1_INTP_MASK                        equ 0002h
CM3CON1_C3INTN_POSN                      equ 0000h
CM3CON1_C3INTN_POSITION                  equ 0000h
CM3CON1_C3INTN_SIZE                      equ 0001h
CM3CON1_C3INTN_LENGTH                    equ 0001h
CM3CON1_C3INTN_MASK                      equ 0001h
CM3CON1_C3INTP_POSN                      equ 0001h
CM3CON1_C3INTP_POSITION                  equ 0001h
CM3CON1_C3INTP_SIZE                      equ 0001h
CM3CON1_C3INTP_LENGTH                    equ 0001h
CM3CON1_C3INTP_MASK                      equ 0002h

// Register: CM3NSEL
#define CM3NSEL CM3NSEL
CM3NSEL                                  equ 011Ah
// bitfield definitions
CM3NSEL_NCH_POSN                         equ 0000h
CM3NSEL_NCH_POSITION                     equ 0000h
CM3NSEL_NCH_SIZE                         equ 0003h
CM3NSEL_NCH_LENGTH                       equ 0003h
CM3NSEL_NCH_MASK                         equ 0007h
CM3NSEL_NCH0_POSN                        equ 0000h
CM3NSEL_NCH0_POSITION                    equ 0000h
CM3NSEL_NCH0_SIZE                        equ 0001h
CM3NSEL_NCH0_LENGTH                      equ 0001h
CM3NSEL_NCH0_MASK                        equ 0001h
CM3NSEL_NCH1_POSN                        equ 0001h
CM3NSEL_NCH1_POSITION                    equ 0001h
CM3NSEL_NCH1_SIZE                        equ 0001h
CM3NSEL_NCH1_LENGTH                      equ 0001h
CM3NSEL_NCH1_MASK                        equ 0002h
CM3NSEL_NCH2_POSN                        equ 0002h
CM3NSEL_NCH2_POSITION                    equ 0002h
CM3NSEL_NCH2_SIZE                        equ 0001h
CM3NSEL_NCH2_LENGTH                      equ 0001h
CM3NSEL_NCH2_MASK                        equ 0004h
CM3NSEL_C3NCH_POSN                       equ 0000h
CM3NSEL_C3NCH_POSITION                   equ 0000h
CM3NSEL_C3NCH_SIZE                       equ 0003h
CM3NSEL_C3NCH_LENGTH                     equ 0003h
CM3NSEL_C3NCH_MASK                       equ 0007h
CM3NSEL_C3NCH0_POSN                      equ 0000h
CM3NSEL_C3NCH0_POSITION                  equ 0000h
CM3NSEL_C3NCH0_SIZE                      equ 0001h
CM3NSEL_C3NCH0_LENGTH                    equ 0001h
CM3NSEL_C3NCH0_MASK                      equ 0001h
CM3NSEL_C3NCH1_POSN                      equ 0001h
CM3NSEL_C3NCH1_POSITION                  equ 0001h
CM3NSEL_C3NCH1_SIZE                      equ 0001h
CM3NSEL_C3NCH1_LENGTH                    equ 0001h
CM3NSEL_C3NCH1_MASK                      equ 0002h
CM3NSEL_C3NCH2_POSN                      equ 0002h
CM3NSEL_C3NCH2_POSITION                  equ 0002h
CM3NSEL_C3NCH2_SIZE                      equ 0001h
CM3NSEL_C3NCH2_LENGTH                    equ 0001h
CM3NSEL_C3NCH2_MASK                      equ 0004h

// Register: CM3PSEL
#define CM3PSEL CM3PSEL
CM3PSEL                                  equ 011Bh
// bitfield definitions
CM3PSEL_PCH_POSN                         equ 0000h
CM3PSEL_PCH_POSITION                     equ 0000h
CM3PSEL_PCH_SIZE                         equ 0004h
CM3PSEL_PCH_LENGTH                       equ 0004h
CM3PSEL_PCH_MASK                         equ 000Fh
CM3PSEL_PCH0_POSN                        equ 0000h
CM3PSEL_PCH0_POSITION                    equ 0000h
CM3PSEL_PCH0_SIZE                        equ 0001h
CM3PSEL_PCH0_LENGTH                      equ 0001h
CM3PSEL_PCH0_MASK                        equ 0001h
CM3PSEL_PCH1_POSN                        equ 0001h
CM3PSEL_PCH1_POSITION                    equ 0001h
CM3PSEL_PCH1_SIZE                        equ 0001h
CM3PSEL_PCH1_LENGTH                      equ 0001h
CM3PSEL_PCH1_MASK                        equ 0002h
CM3PSEL_PCH2_POSN                        equ 0002h
CM3PSEL_PCH2_POSITION                    equ 0002h
CM3PSEL_PCH2_SIZE                        equ 0001h
CM3PSEL_PCH2_LENGTH                      equ 0001h
CM3PSEL_PCH2_MASK                        equ 0004h
CM3PSEL_PCH3_POSN                        equ 0003h
CM3PSEL_PCH3_POSITION                    equ 0003h
CM3PSEL_PCH3_SIZE                        equ 0001h
CM3PSEL_PCH3_LENGTH                      equ 0001h
CM3PSEL_PCH3_MASK                        equ 0008h
CM3PSEL_C3PCH_POSN                       equ 0000h
CM3PSEL_C3PCH_POSITION                   equ 0000h
CM3PSEL_C3PCH_SIZE                       equ 0004h
CM3PSEL_C3PCH_LENGTH                     equ 0004h
CM3PSEL_C3PCH_MASK                       equ 000Fh
CM3PSEL_C3PCH0_POSN                      equ 0000h
CM3PSEL_C3PCH0_POSITION                  equ 0000h
CM3PSEL_C3PCH0_SIZE                      equ 0001h
CM3PSEL_C3PCH0_LENGTH                    equ 0001h
CM3PSEL_C3PCH0_MASK                      equ 0001h
CM3PSEL_C3PCH1_POSN                      equ 0001h
CM3PSEL_C3PCH1_POSITION                  equ 0001h
CM3PSEL_C3PCH1_SIZE                      equ 0001h
CM3PSEL_C3PCH1_LENGTH                    equ 0001h
CM3PSEL_C3PCH1_MASK                      equ 0002h
CM3PSEL_C3PCH2_POSN                      equ 0002h
CM3PSEL_C3PCH2_POSITION                  equ 0002h
CM3PSEL_C3PCH2_SIZE                      equ 0001h
CM3PSEL_C3PCH2_LENGTH                    equ 0001h
CM3PSEL_C3PCH2_MASK                      equ 0004h
CM3PSEL_C3PCH3_POSN                      equ 0003h
CM3PSEL_C3PCH3_POSITION                  equ 0003h
CM3PSEL_C3PCH3_SIZE                      equ 0001h
CM3PSEL_C3PCH3_LENGTH                    equ 0001h
CM3PSEL_C3PCH3_MASK                      equ 0008h

// Register: CM4CON0
#define CM4CON0 CM4CON0
CM4CON0                                  equ 011Ch
// bitfield definitions
CM4CON0_SYNC_POSN                        equ 0000h
CM4CON0_SYNC_POSITION                    equ 0000h
CM4CON0_SYNC_SIZE                        equ 0001h
CM4CON0_SYNC_LENGTH                      equ 0001h
CM4CON0_SYNC_MASK                        equ 0001h
CM4CON0_HYS_POSN                         equ 0001h
CM4CON0_HYS_POSITION                     equ 0001h
CM4CON0_HYS_SIZE                         equ 0001h
CM4CON0_HYS_LENGTH                       equ 0001h
CM4CON0_HYS_MASK                         equ 0002h
CM4CON0_ZLF_POSN                         equ 0003h
CM4CON0_ZLF_POSITION                     equ 0003h
CM4CON0_ZLF_SIZE                         equ 0001h
CM4CON0_ZLF_LENGTH                       equ 0001h
CM4CON0_ZLF_MASK                         equ 0008h
CM4CON0_POL_POSN                         equ 0004h
CM4CON0_POL_POSITION                     equ 0004h
CM4CON0_POL_SIZE                         equ 0001h
CM4CON0_POL_LENGTH                       equ 0001h
CM4CON0_POL_MASK                         equ 0010h
CM4CON0_OUT_POSN                         equ 0006h
CM4CON0_OUT_POSITION                     equ 0006h
CM4CON0_OUT_SIZE                         equ 0001h
CM4CON0_OUT_LENGTH                       equ 0001h
CM4CON0_OUT_MASK                         equ 0040h
CM4CON0_ON_POSN                          equ 0007h
CM4CON0_ON_POSITION                      equ 0007h
CM4CON0_ON_SIZE                          equ 0001h
CM4CON0_ON_LENGTH                        equ 0001h
CM4CON0_ON_MASK                          equ 0080h
CM4CON0_C4SYNC_POSN                      equ 0000h
CM4CON0_C4SYNC_POSITION                  equ 0000h
CM4CON0_C4SYNC_SIZE                      equ 0001h
CM4CON0_C4SYNC_LENGTH                    equ 0001h
CM4CON0_C4SYNC_MASK                      equ 0001h
CM4CON0_C4HYS_POSN                       equ 0001h
CM4CON0_C4HYS_POSITION                   equ 0001h
CM4CON0_C4HYS_SIZE                       equ 0001h
CM4CON0_C4HYS_LENGTH                     equ 0001h
CM4CON0_C4HYS_MASK                       equ 0002h
CM4CON0_C4SP_POSN                        equ 0002h
CM4CON0_C4SP_POSITION                    equ 0002h
CM4CON0_C4SP_SIZE                        equ 0001h
CM4CON0_C4SP_LENGTH                      equ 0001h
CM4CON0_C4SP_MASK                        equ 0004h
CM4CON0_C4ZLF_POSN                       equ 0003h
CM4CON0_C4ZLF_POSITION                   equ 0003h
CM4CON0_C4ZLF_SIZE                       equ 0001h
CM4CON0_C4ZLF_LENGTH                     equ 0001h
CM4CON0_C4ZLF_MASK                       equ 0008h
CM4CON0_C4POL_POSN                       equ 0004h
CM4CON0_C4POL_POSITION                   equ 0004h
CM4CON0_C4POL_SIZE                       equ 0001h
CM4CON0_C4POL_LENGTH                     equ 0001h
CM4CON0_C4POL_MASK                       equ 0010h
CM4CON0_C4OUT_POSN                       equ 0006h
CM4CON0_C4OUT_POSITION                   equ 0006h
CM4CON0_C4OUT_SIZE                       equ 0001h
CM4CON0_C4OUT_LENGTH                     equ 0001h
CM4CON0_C4OUT_MASK                       equ 0040h
CM4CON0_C4ON_POSN                        equ 0007h
CM4CON0_C4ON_POSITION                    equ 0007h
CM4CON0_C4ON_SIZE                        equ 0001h
CM4CON0_C4ON_LENGTH                      equ 0001h
CM4CON0_C4ON_MASK                        equ 0080h

// Register: CM4CON1
#define CM4CON1 CM4CON1
CM4CON1                                  equ 011Dh
// bitfield definitions
CM4CON1_INTN_POSN                        equ 0000h
CM4CON1_INTN_POSITION                    equ 0000h
CM4CON1_INTN_SIZE                        equ 0001h
CM4CON1_INTN_LENGTH                      equ 0001h
CM4CON1_INTN_MASK                        equ 0001h
CM4CON1_INTP_POSN                        equ 0001h
CM4CON1_INTP_POSITION                    equ 0001h
CM4CON1_INTP_SIZE                        equ 0001h
CM4CON1_INTP_LENGTH                      equ 0001h
CM4CON1_INTP_MASK                        equ 0002h
CM4CON1_C4INTN_POSN                      equ 0000h
CM4CON1_C4INTN_POSITION                  equ 0000h
CM4CON1_C4INTN_SIZE                      equ 0001h
CM4CON1_C4INTN_LENGTH                    equ 0001h
CM4CON1_C4INTN_MASK                      equ 0001h
CM4CON1_C4INTP_POSN                      equ 0001h
CM4CON1_C4INTP_POSITION                  equ 0001h
CM4CON1_C4INTP_SIZE                      equ 0001h
CM4CON1_C4INTP_LENGTH                    equ 0001h
CM4CON1_C4INTP_MASK                      equ 0002h

// Register: CM4NSEL
#define CM4NSEL CM4NSEL
CM4NSEL                                  equ 011Eh
// bitfield definitions
CM4NSEL_NCH_POSN                         equ 0000h
CM4NSEL_NCH_POSITION                     equ 0000h
CM4NSEL_NCH_SIZE                         equ 0003h
CM4NSEL_NCH_LENGTH                       equ 0003h
CM4NSEL_NCH_MASK                         equ 0007h
CM4NSEL_NCH0_POSN                        equ 0000h
CM4NSEL_NCH0_POSITION                    equ 0000h
CM4NSEL_NCH0_SIZE                        equ 0001h
CM4NSEL_NCH0_LENGTH                      equ 0001h
CM4NSEL_NCH0_MASK                        equ 0001h
CM4NSEL_NCH1_POSN                        equ 0001h
CM4NSEL_NCH1_POSITION                    equ 0001h
CM4NSEL_NCH1_SIZE                        equ 0001h
CM4NSEL_NCH1_LENGTH                      equ 0001h
CM4NSEL_NCH1_MASK                        equ 0002h
CM4NSEL_NCH2_POSN                        equ 0002h
CM4NSEL_NCH2_POSITION                    equ 0002h
CM4NSEL_NCH2_SIZE                        equ 0001h
CM4NSEL_NCH2_LENGTH                      equ 0001h
CM4NSEL_NCH2_MASK                        equ 0004h
CM4NSEL_C4NCH_POSN                       equ 0000h
CM4NSEL_C4NCH_POSITION                   equ 0000h
CM4NSEL_C4NCH_SIZE                       equ 0003h
CM4NSEL_C4NCH_LENGTH                     equ 0003h
CM4NSEL_C4NCH_MASK                       equ 0007h
CM4NSEL_C4NCH0_POSN                      equ 0000h
CM4NSEL_C4NCH0_POSITION                  equ 0000h
CM4NSEL_C4NCH0_SIZE                      equ 0001h
CM4NSEL_C4NCH0_LENGTH                    equ 0001h
CM4NSEL_C4NCH0_MASK                      equ 0001h
CM4NSEL_C4NCH1_POSN                      equ 0001h
CM4NSEL_C4NCH1_POSITION                  equ 0001h
CM4NSEL_C4NCH1_SIZE                      equ 0001h
CM4NSEL_C4NCH1_LENGTH                    equ 0001h
CM4NSEL_C4NCH1_MASK                      equ 0002h
CM4NSEL_C4NCH2_POSN                      equ 0002h
CM4NSEL_C4NCH2_POSITION                  equ 0002h
CM4NSEL_C4NCH2_SIZE                      equ 0001h
CM4NSEL_C4NCH2_LENGTH                    equ 0001h
CM4NSEL_C4NCH2_MASK                      equ 0004h

// Register: CM4PSEL
#define CM4PSEL CM4PSEL
CM4PSEL                                  equ 011Fh
// bitfield definitions
CM4PSEL_PCH_POSN                         equ 0000h
CM4PSEL_PCH_POSITION                     equ 0000h
CM4PSEL_PCH_SIZE                         equ 0004h
CM4PSEL_PCH_LENGTH                       equ 0004h
CM4PSEL_PCH_MASK                         equ 000Fh
CM4PSEL_PCH0_POSN                        equ 0000h
CM4PSEL_PCH0_POSITION                    equ 0000h
CM4PSEL_PCH0_SIZE                        equ 0001h
CM4PSEL_PCH0_LENGTH                      equ 0001h
CM4PSEL_PCH0_MASK                        equ 0001h
CM4PSEL_PCH1_POSN                        equ 0001h
CM4PSEL_PCH1_POSITION                    equ 0001h
CM4PSEL_PCH1_SIZE                        equ 0001h
CM4PSEL_PCH1_LENGTH                      equ 0001h
CM4PSEL_PCH1_MASK                        equ 0002h
CM4PSEL_PCH2_POSN                        equ 0002h
CM4PSEL_PCH2_POSITION                    equ 0002h
CM4PSEL_PCH2_SIZE                        equ 0001h
CM4PSEL_PCH2_LENGTH                      equ 0001h
CM4PSEL_PCH2_MASK                        equ 0004h
CM4PSEL_PCH3_POSN                        equ 0003h
CM4PSEL_PCH3_POSITION                    equ 0003h
CM4PSEL_PCH3_SIZE                        equ 0001h
CM4PSEL_PCH3_LENGTH                      equ 0001h
CM4PSEL_PCH3_MASK                        equ 0008h
CM4PSEL_C4PCH_POSN                       equ 0000h
CM4PSEL_C4PCH_POSITION                   equ 0000h
CM4PSEL_C4PCH_SIZE                       equ 0004h
CM4PSEL_C4PCH_LENGTH                     equ 0004h
CM4PSEL_C4PCH_MASK                       equ 000Fh
CM4PSEL_C4PCH0_POSN                      equ 0000h
CM4PSEL_C4PCH0_POSITION                  equ 0000h
CM4PSEL_C4PCH0_SIZE                      equ 0001h
CM4PSEL_C4PCH0_LENGTH                    equ 0001h
CM4PSEL_C4PCH0_MASK                      equ 0001h
CM4PSEL_C4PCH1_POSN                      equ 0001h
CM4PSEL_C4PCH1_POSITION                  equ 0001h
CM4PSEL_C4PCH1_SIZE                      equ 0001h
CM4PSEL_C4PCH1_LENGTH                    equ 0001h
CM4PSEL_C4PCH1_MASK                      equ 0002h
CM4PSEL_C4PCH2_POSN                      equ 0002h
CM4PSEL_C4PCH2_POSITION                  equ 0002h
CM4PSEL_C4PCH2_SIZE                      equ 0001h
CM4PSEL_C4PCH2_LENGTH                    equ 0001h
CM4PSEL_C4PCH2_MASK                      equ 0004h
CM4PSEL_C4PCH3_POSN                      equ 0003h
CM4PSEL_C4PCH3_POSITION                  equ 0003h
CM4PSEL_C4PCH3_SIZE                      equ 0001h
CM4PSEL_C4PCH3_LENGTH                    equ 0001h
CM4PSEL_C4PCH3_MASK                      equ 0008h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 018Ch
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h

// Register: ANSELB
#define ANSELB ANSELB
ANSELB                                   equ 018Dh
// bitfield definitions
ANSELB_ANSB4_POSN                        equ 0004h
ANSELB_ANSB4_POSITION                    equ 0004h
ANSELB_ANSB4_SIZE                        equ 0001h
ANSELB_ANSB4_LENGTH                      equ 0001h
ANSELB_ANSB4_MASK                        equ 0010h
ANSELB_ANSB5_POSN                        equ 0005h
ANSELB_ANSB5_POSITION                    equ 0005h
ANSELB_ANSB5_SIZE                        equ 0001h
ANSELB_ANSB5_LENGTH                      equ 0001h
ANSELB_ANSB5_MASK                        equ 0020h
ANSELB_ANSB6_POSN                        equ 0006h
ANSELB_ANSB6_POSITION                    equ 0006h
ANSELB_ANSB6_SIZE                        equ 0001h
ANSELB_ANSB6_LENGTH                      equ 0001h
ANSELB_ANSB6_MASK                        equ 0040h
ANSELB_ANSB7_POSN                        equ 0007h
ANSELB_ANSB7_POSITION                    equ 0007h
ANSELB_ANSB7_SIZE                        equ 0001h
ANSELB_ANSB7_LENGTH                      equ 0001h
ANSELB_ANSB7_MASK                        equ 0080h

