GopalSaraf/Practicals/PSDL/include/proc/pic16f1769.inc
// Register: TMR3H
#define TMR3H TMR3H
TMR3H                                    equ 0494h
// bitfield definitions
TMR3H_TMR_POSN                           equ 0000h
TMR3H_TMR_POSITION                       equ 0000h
TMR3H_TMR_SIZE                           equ 0008h
TMR3H_TMR_LENGTH                         equ 0008h
TMR3H_TMR_MASK                           equ 00FFh

// Register: T3CON
#define T3CON T3CON
T3CON                                    equ 0495h
// bitfield definitions
T3CON_ON_POSN                            equ 0000h
T3CON_ON_POSITION                        equ 0000h
T3CON_ON_SIZE                            equ 0001h
T3CON_ON_LENGTH                          equ 0001h
T3CON_ON_MASK                            equ 0001h
T3CON_nSYNC_POSN                         equ 0002h
T3CON_nSYNC_POSITION                     equ 0002h
T3CON_nSYNC_SIZE                         equ 0001h
T3CON_nSYNC_LENGTH                       equ 0001h
T3CON_nSYNC_MASK                         equ 0004h
T3CON_CKPS_POSN                          equ 0004h
T3CON_CKPS_POSITION                      equ 0004h
T3CON_CKPS_SIZE                          equ 0002h
T3CON_CKPS_LENGTH                        equ 0002h
T3CON_CKPS_MASK                          equ 0030h
T3CON_CS_POSN                            equ 0006h
T3CON_CS_POSITION                        equ 0006h
T3CON_CS_SIZE                            equ 0002h
T3CON_CS_LENGTH                          equ 0002h
T3CON_CS_MASK                            equ 00C0h
T3CON_TMRON_POSN                         equ 0000h
T3CON_TMRON_POSITION                     equ 0000h
T3CON_TMRON_SIZE                         equ 0001h
T3CON_TMRON_LENGTH                       equ 0001h
T3CON_TMRON_MASK                         equ 0001h
T3CON_SYNC_POSN                          equ 0002h
T3CON_SYNC_POSITION                      equ 0002h
T3CON_SYNC_SIZE                          equ 0001h
T3CON_SYNC_LENGTH                        equ 0001h
T3CON_SYNC_MASK                          equ 0004h
T3CON_CKPS0_POSN                         equ 0004h
T3CON_CKPS0_POSITION                     equ 0004h
T3CON_CKPS0_SIZE                         equ 0001h
T3CON_CKPS0_LENGTH                       equ 0001h
T3CON_CKPS0_MASK                         equ 0010h
T3CON_CKPS1_POSN                         equ 0005h
T3CON_CKPS1_POSITION                     equ 0005h
T3CON_CKPS1_SIZE                         equ 0001h
T3CON_CKPS1_LENGTH                       equ 0001h
T3CON_CKPS1_MASK                         equ 0020h
T3CON_CS0_POSN                           equ 0006h
T3CON_CS0_POSITION                       equ 0006h
T3CON_CS0_SIZE                           equ 0001h
T3CON_CS0_LENGTH                         equ 0001h
T3CON_CS0_MASK                           equ 0040h
T3CON_CS1_POSN                           equ 0007h
T3CON_CS1_POSITION                       equ 0007h
T3CON_CS1_SIZE                           equ 0001h
T3CON_CS1_LENGTH                         equ 0001h
T3CON_CS1_MASK                           equ 0080h
T3CON_TMR3ON_POSN                        equ 0000h
T3CON_TMR3ON_POSITION                    equ 0000h
T3CON_TMR3ON_SIZE                        equ 0001h
T3CON_TMR3ON_LENGTH                      equ 0001h
T3CON_TMR3ON_MASK                        equ 0001h
T3CON_nT3SYNC_POSN                       equ 0002h
T3CON_nT3SYNC_POSITION                   equ 0002h
T3CON_nT3SYNC_SIZE                       equ 0001h
T3CON_nT3SYNC_LENGTH                     equ 0001h
T3CON_nT3SYNC_MASK                       equ 0004h
T3CON_T3CS0_POSN                         equ 0006h
T3CON_T3CS0_POSITION                     equ 0006h
T3CON_T3CS0_SIZE                         equ 0001h
T3CON_T3CS0_LENGTH                       equ 0001h
T3CON_T3CS0_MASK                         equ 0040h
T3CON_T3CS1_POSN                         equ 0007h
T3CON_T3CS1_POSITION                     equ 0007h
T3CON_T3CS1_SIZE                         equ 0001h
T3CON_T3CS1_LENGTH                       equ 0001h
T3CON_T3CS1_MASK                         equ 0080h
T3CON_T3ON_POSN                          equ 0000h
T3CON_T3ON_POSITION                      equ 0000h
T3CON_T3ON_SIZE                          equ 0001h
T3CON_T3ON_LENGTH                        equ 0001h
T3CON_T3ON_MASK                          equ 0001h
T3CON_T3CKPS0_POSN                       equ 0004h
T3CON_T3CKPS0_POSITION                   equ 0004h
T3CON_T3CKPS0_SIZE                       equ 0001h
T3CON_T3CKPS0_LENGTH                     equ 0001h
T3CON_T3CKPS0_MASK                       equ 0010h
T3CON_T3CKPS1_POSN                       equ 0005h
T3CON_T3CKPS1_POSITION                   equ 0005h
T3CON_T3CKPS1_SIZE                       equ 0001h
T3CON_T3CKPS1_LENGTH                     equ 0001h
T3CON_T3CKPS1_MASK                       equ 0020h
T3CON_TMR3CS0_POSN                       equ 0006h
T3CON_TMR3CS0_POSITION                   equ 0006h
T3CON_TMR3CS0_SIZE                       equ 0001h
T3CON_TMR3CS0_LENGTH                     equ 0001h
T3CON_TMR3CS0_MASK                       equ 0040h
T3CON_TMR3CS1_POSN                       equ 0007h
T3CON_TMR3CS1_POSITION                   equ 0007h
T3CON_TMR3CS1_SIZE                       equ 0001h
T3CON_TMR3CS1_LENGTH                     equ 0001h
T3CON_TMR3CS1_MASK                       equ 0080h

// Register: T3GCON
#define T3GCON T3GCON
T3GCON                                   equ 0496h
// bitfield definitions
T3GCON_GSS_POSN                          equ 0000h
T3GCON_GSS_POSITION                      equ 0000h
T3GCON_GSS_SIZE                          equ 0002h
T3GCON_GSS_LENGTH                        equ 0002h
T3GCON_GSS_MASK                          equ 0003h
T3GCON_GVAL_POSN                         equ 0002h
T3GCON_GVAL_POSITION                     equ 0002h
T3GCON_GVAL_SIZE                         equ 0001h
T3GCON_GVAL_LENGTH                       equ 0001h
T3GCON_GVAL_MASK                         equ 0004h
T3GCON_GGO_nDONE_POSN                    equ 0003h
T3GCON_GGO_nDONE_POSITION                equ 0003h
T3GCON_GGO_nDONE_SIZE                    equ 0001h
T3GCON_GGO_nDONE_LENGTH                  equ 0001h
T3GCON_GGO_nDONE_MASK                    equ 0008h
T3GCON_GSPM_POSN                         equ 0004h
T3GCON_GSPM_POSITION                     equ 0004h
T3GCON_GSPM_SIZE                         equ 0001h
T3GCON_GSPM_LENGTH                       equ 0001h
T3GCON_GSPM_MASK                         equ 0010h
T3GCON_GTM_POSN                          equ 0005h
T3GCON_GTM_POSITION                      equ 0005h
T3GCON_GTM_SIZE                          equ 0001h
T3GCON_GTM_LENGTH                        equ 0001h
T3GCON_GTM_MASK                          equ 0020h
T3GCON_GPOL_POSN                         equ 0006h
T3GCON_GPOL_POSITION                     equ 0006h
T3GCON_GPOL_SIZE                         equ 0001h
T3GCON_GPOL_LENGTH                       equ 0001h
T3GCON_GPOL_MASK                         equ 0040h
T3GCON_GE_POSN                           equ 0007h
T3GCON_GE_POSITION                       equ 0007h
T3GCON_GE_SIZE                           equ 0001h
T3GCON_GE_LENGTH                         equ 0001h
T3GCON_GE_MASK                           equ 0080h
T3GCON_GSS0_POSN                         equ 0000h
T3GCON_GSS0_POSITION                     equ 0000h
T3GCON_GSS0_SIZE                         equ 0001h
T3GCON_GSS0_LENGTH                       equ 0001h
T3GCON_GSS0_MASK                         equ 0001h
T3GCON_GSS1_POSN                         equ 0001h
T3GCON_GSS1_POSITION                     equ 0001h
T3GCON_GSS1_SIZE                         equ 0001h
T3GCON_GSS1_LENGTH                       equ 0001h
T3GCON_GSS1_MASK                         equ 0002h
T3GCON_T3GE_POSN                         equ 0007h
T3GCON_T3GE_POSITION                     equ 0007h
T3GCON_T3GE_SIZE                         equ 0001h
T3GCON_T3GE_LENGTH                       equ 0001h
T3GCON_T3GE_MASK                         equ 0080h
T3GCON_T3GVAL_POSN                       equ 0002h
T3GCON_T3GVAL_POSITION                   equ 0002h
T3GCON_T3GVAL_SIZE                       equ 0001h
T3GCON_T3GVAL_LENGTH                     equ 0001h
T3GCON_T3GVAL_MASK                       equ 0004h
T3GCON_T3GGO_nDONE_POSN                  equ 0003h
T3GCON_T3GGO_nDONE_POSITION              equ 0003h
T3GCON_T3GGO_nDONE_SIZE                  equ 0001h
T3GCON_T3GGO_nDONE_LENGTH                equ 0001h
T3GCON_T3GGO_nDONE_MASK                  equ 0008h
T3GCON_T3GSPM_POSN                       equ 0004h
T3GCON_T3GSPM_POSITION                   equ 0004h
T3GCON_T3GSPM_SIZE                       equ 0001h
T3GCON_T3GSPM_LENGTH                     equ 0001h
T3GCON_T3GSPM_MASK                       equ 0010h
T3GCON_T3GTM_POSN                        equ 0005h
T3GCON_T3GTM_POSITION                    equ 0005h
T3GCON_T3GTM_SIZE                        equ 0001h
T3GCON_T3GTM_LENGTH                      equ 0001h
T3GCON_T3GTM_MASK                        equ 0020h
T3GCON_T3GPOL_POSN                       equ 0006h
T3GCON_T3GPOL_POSITION                   equ 0006h
T3GCON_T3GPOL_SIZE                       equ 0001h
T3GCON_T3GPOL_LENGTH                     equ 0001h
T3GCON_T3GPOL_MASK                       equ 0040h
T3GCON_TMR3GE_POSN                       equ 0007h
T3GCON_TMR3GE_POSITION                   equ 0007h
T3GCON_TMR3GE_SIZE                       equ 0001h
T3GCON_TMR3GE_LENGTH                     equ 0001h
T3GCON_TMR3GE_MASK                       equ 0080h
T3GCON_T3GSS0_POSN                       equ 0000h
T3GCON_T3GSS0_POSITION                   equ 0000h
T3GCON_T3GSS0_SIZE                       equ 0001h
T3GCON_T3GSS0_LENGTH                     equ 0001h
T3GCON_T3GSS0_MASK                       equ 0001h
T3GCON_T3GSS1_POSN                       equ 0001h
T3GCON_T3GSS1_POSITION                   equ 0001h
T3GCON_T3GSS1_SIZE                       equ 0001h
T3GCON_T3GSS1_LENGTH                     equ 0001h
T3GCON_T3GSS1_MASK                       equ 0002h

// Register: TMR5L
#define TMR5L TMR5L
TMR5L                                    equ 049Ah
// bitfield definitions
TMR5L_TMR_POSN                           equ 0000h
TMR5L_TMR_POSITION                       equ 0000h
TMR5L_TMR_SIZE                           equ 0008h
TMR5L_TMR_LENGTH                         equ 0008h
TMR5L_TMR_MASK                           equ 00FFh

// Register: TMR5H
#define TMR5H TMR5H
TMR5H                                    equ 049Bh
// bitfield definitions
TMR5H_TMR_POSN                           equ 0000h
TMR5H_TMR_POSITION                       equ 0000h
TMR5H_TMR_SIZE                           equ 0008h
TMR5H_TMR_LENGTH                         equ 0008h
TMR5H_TMR_MASK                           equ 00FFh

// Register: T5CON
#define T5CON T5CON
T5CON                                    equ 049Ch
// bitfield definitions
T5CON_ON_POSN                            equ 0000h
T5CON_ON_POSITION                        equ 0000h
T5CON_ON_SIZE                            equ 0001h
T5CON_ON_LENGTH                          equ 0001h
T5CON_ON_MASK                            equ 0001h
T5CON_nSYNC_POSN                         equ 0002h
T5CON_nSYNC_POSITION                     equ 0002h
T5CON_nSYNC_SIZE                         equ 0001h
T5CON_nSYNC_LENGTH                       equ 0001h
T5CON_nSYNC_MASK                         equ 0004h
T5CON_CKPS_POSN                          equ 0004h
T5CON_CKPS_POSITION                      equ 0004h
T5CON_CKPS_SIZE                          equ 0002h
T5CON_CKPS_LENGTH                        equ 0002h
T5CON_CKPS_MASK                          equ 0030h
T5CON_CS_POSN                            equ 0006h
T5CON_CS_POSITION                        equ 0006h
T5CON_CS_SIZE                            equ 0002h
T5CON_CS_LENGTH                          equ 0002h
T5CON_CS_MASK                            equ 00C0h
T5CON_TMRON_POSN                         equ 0000h
T5CON_TMRON_POSITION                     equ 0000h
T5CON_TMRON_SIZE                         equ 0001h
T5CON_TMRON_LENGTH                       equ 0001h
T5CON_TMRON_MASK                         equ 0001h
T5CON_SYNC_POSN                          equ 0002h
T5CON_SYNC_POSITION                      equ 0002h
T5CON_SYNC_SIZE                          equ 0001h
T5CON_SYNC_LENGTH                        equ 0001h
T5CON_SYNC_MASK                          equ 0004h
T5CON_CKPS0_POSN                         equ 0004h
T5CON_CKPS0_POSITION                     equ 0004h
T5CON_CKPS0_SIZE                         equ 0001h
T5CON_CKPS0_LENGTH                       equ 0001h
T5CON_CKPS0_MASK                         equ 0010h
T5CON_CKPS1_POSN                         equ 0005h
T5CON_CKPS1_POSITION                     equ 0005h
T5CON_CKPS1_SIZE                         equ 0001h
T5CON_CKPS1_LENGTH                       equ 0001h
T5CON_CKPS1_MASK                         equ 0020h
T5CON_CS0_POSN                           equ 0006h
T5CON_CS0_POSITION                       equ 0006h
T5CON_CS0_SIZE                           equ 0001h
T5CON_CS0_LENGTH                         equ 0001h
T5CON_CS0_MASK                           equ 0040h
T5CON_CS1_POSN                           equ 0007h
T5CON_CS1_POSITION                       equ 0007h
T5CON_CS1_SIZE                           equ 0001h
T5CON_CS1_LENGTH                         equ 0001h
T5CON_CS1_MASK                           equ 0080h
T5CON_TMR5ON_POSN                        equ 0000h
T5CON_TMR5ON_POSITION                    equ 0000h
T5CON_TMR5ON_SIZE                        equ 0001h
T5CON_TMR5ON_LENGTH                      equ 0001h
T5CON_TMR5ON_MASK                        equ 0001h
T5CON_nT5SYNC_POSN                       equ 0002h
T5CON_nT5SYNC_POSITION                   equ 0002h
T5CON_nT5SYNC_SIZE                       equ 0001h
T5CON_nT5SYNC_LENGTH                     equ 0001h
T5CON_nT5SYNC_MASK                       equ 0004h
T5CON_T5CS0_POSN                         equ 0006h
T5CON_T5CS0_POSITION                     equ 0006h
T5CON_T5CS0_SIZE                         equ 0001h
T5CON_T5CS0_LENGTH                       equ 0001h
T5CON_T5CS0_MASK                         equ 0040h
T5CON_T5CS1_POSN                         equ 0007h
T5CON_T5CS1_POSITION                     equ 0007h
T5CON_T5CS1_SIZE                         equ 0001h
T5CON_T5CS1_LENGTH                       equ 0001h
T5CON_T5CS1_MASK                         equ 0080h
T5CON_T5ON_POSN                          equ 0000h
T5CON_T5ON_POSITION                      equ 0000h
T5CON_T5ON_SIZE                          equ 0001h
T5CON_T5ON_LENGTH                        equ 0001h
T5CON_T5ON_MASK                          equ 0001h
T5CON_T5CKPS0_POSN                       equ 0004h
T5CON_T5CKPS0_POSITION                   equ 0004h
T5CON_T5CKPS0_SIZE                       equ 0001h
T5CON_T5CKPS0_LENGTH                     equ 0001h
T5CON_T5CKPS0_MASK                       equ 0010h
T5CON_T5CKPS1_POSN                       equ 0005h
T5CON_T5CKPS1_POSITION                   equ 0005h
T5CON_T5CKPS1_SIZE                       equ 0001h
T5CON_T5CKPS1_LENGTH                     equ 0001h
T5CON_T5CKPS1_MASK                       equ 0020h
T5CON_TMR5CS0_POSN                       equ 0006h
T5CON_TMR5CS0_POSITION                   equ 0006h
T5CON_TMR5CS0_SIZE                       equ 0001h
T5CON_TMR5CS0_LENGTH                     equ 0001h
T5CON_TMR5CS0_MASK                       equ 0040h
T5CON_TMR5CS1_POSN                       equ 0007h
T5CON_TMR5CS1_POSITION                   equ 0007h
T5CON_TMR5CS1_SIZE                       equ 0001h
T5CON_TMR5CS1_LENGTH                     equ 0001h
T5CON_TMR5CS1_MASK                       equ 0080h

// Register: T5GCON
#define T5GCON T5GCON
T5GCON                                   equ 049Dh
// bitfield definitions
T5GCON_GSS_POSN                          equ 0000h
T5GCON_GSS_POSITION                      equ 0000h
T5GCON_GSS_SIZE                          equ 0002h
T5GCON_GSS_LENGTH                        equ 0002h
T5GCON_GSS_MASK                          equ 0003h
T5GCON_GVAL_POSN                         equ 0002h
T5GCON_GVAL_POSITION                     equ 0002h
T5GCON_GVAL_SIZE                         equ 0001h
T5GCON_GVAL_LENGTH                       equ 0001h
T5GCON_GVAL_MASK                         equ 0004h
T5GCON_GGO_nDONE_POSN                    equ 0003h
T5GCON_GGO_nDONE_POSITION                equ 0003h
T5GCON_GGO_nDONE_SIZE                    equ 0001h
T5GCON_GGO_nDONE_LENGTH                  equ 0001h
T5GCON_GGO_nDONE_MASK                    equ 0008h
T5GCON_GSPM_POSN                         equ 0004h
T5GCON_GSPM_POSITION                     equ 0004h
T5GCON_GSPM_SIZE                         equ 0001h
T5GCON_GSPM_LENGTH                       equ 0001h
T5GCON_GSPM_MASK                         equ 0010h
T5GCON_GTM_POSN                          equ 0005h
T5GCON_GTM_POSITION                      equ 0005h
T5GCON_GTM_SIZE                          equ 0001h
T5GCON_GTM_LENGTH                        equ 0001h
T5GCON_GTM_MASK                          equ 0020h
T5GCON_GPOL_POSN                         equ 0006h
T5GCON_GPOL_POSITION                     equ 0006h
T5GCON_GPOL_SIZE                         equ 0001h
T5GCON_GPOL_LENGTH                       equ 0001h
T5GCON_GPOL_MASK                         equ 0040h
T5GCON_GE_POSN                           equ 0007h
T5GCON_GE_POSITION                       equ 0007h
T5GCON_GE_SIZE                           equ 0001h
T5GCON_GE_LENGTH                         equ 0001h
T5GCON_GE_MASK                           equ 0080h
T5GCON_GSS0_POSN                         equ 0000h
T5GCON_GSS0_POSITION                     equ 0000h
T5GCON_GSS0_SIZE                         equ 0001h
T5GCON_GSS0_LENGTH                       equ 0001h
T5GCON_GSS0_MASK                         equ 0001h
T5GCON_GSS1_POSN                         equ 0001h
T5GCON_GSS1_POSITION                     equ 0001h
T5GCON_GSS1_SIZE                         equ 0001h
T5GCON_GSS1_LENGTH                       equ 0001h
T5GCON_GSS1_MASK                         equ 0002h
T5GCON_T5GE_POSN                         equ 0007h
T5GCON_T5GE_POSITION                     equ 0007h
T5GCON_T5GE_SIZE                         equ 0001h
T5GCON_T5GE_LENGTH                       equ 0001h
T5GCON_T5GE_MASK                         equ 0080h
T5GCON_T5GVAL_POSN                       equ 0002h
T5GCON_T5GVAL_POSITION                   equ 0002h
T5GCON_T5GVAL_SIZE                       equ 0001h
T5GCON_T5GVAL_LENGTH                     equ 0001h
T5GCON_T5GVAL_MASK                       equ 0004h
T5GCON_T5GGO_nDONE_POSN                  equ 0003h
T5GCON_T5GGO_nDONE_POSITION              equ 0003h
T5GCON_T5GGO_nDONE_SIZE                  equ 0001h
T5GCON_T5GGO_nDONE_LENGTH                equ 0001h
T5GCON_T5GGO_nDONE_MASK                  equ 0008h
T5GCON_T5GSPM_POSN                       equ 0004h
T5GCON_T5GSPM_POSITION                   equ 0004h
T5GCON_T5GSPM_SIZE                       equ 0001h
T5GCON_T5GSPM_LENGTH                     equ 0001h
T5GCON_T5GSPM_MASK                       equ 0010h
T5GCON_T5GTM_POSN                        equ 0005h
T5GCON_T5GTM_POSITION                    equ 0005h
T5GCON_T5GTM_SIZE                        equ 0001h
T5GCON_T5GTM_LENGTH                      equ 0001h
T5GCON_T5GTM_MASK                        equ 0020h
T5GCON_T5GPOL_POSN                       equ 0006h
T5GCON_T5GPOL_POSITION                   equ 0006h
T5GCON_T5GPOL_SIZE                       equ 0001h
T5GCON_T5GPOL_LENGTH                     equ 0001h
T5GCON_T5GPOL_MASK                       equ 0040h
T5GCON_TMR5GE_POSN                       equ 0007h
T5GCON_TMR5GE_POSITION                   equ 0007h
T5GCON_TMR5GE_SIZE                       equ 0001h
T5GCON_TMR5GE_LENGTH                     equ 0001h
T5GCON_TMR5GE_MASK                       equ 0080h
T5GCON_T5GSS0_POSN                       equ 0000h
T5GCON_T5GSS0_POSITION                   equ 0000h
T5GCON_T5GSS0_SIZE                       equ 0001h
T5GCON_T5GSS0_LENGTH                     equ 0001h
T5GCON_T5GSS0_MASK                       equ 0001h
T5GCON_T5GSS1_POSN                       equ 0001h
T5GCON_T5GSS1_POSITION                   equ 0001h
T5GCON_T5GSS1_SIZE                       equ 0001h
T5GCON_T5GSS1_LENGTH                     equ 0001h
T5GCON_T5GSS1_MASK                       equ 0002h

// Register: OPA1NCHS
#define OPA1NCHS OPA1NCHS
OPA1NCHS                                 equ 050Fh
// bitfield definitions
OPA1NCHS_NCH_POSN                        equ 0000h
OPA1NCHS_NCH_POSITION                    equ 0000h
OPA1NCHS_NCH_SIZE                        equ 0008h
OPA1NCHS_NCH_LENGTH                      equ 0008h
OPA1NCHS_NCH_MASK                        equ 00FFh
OPA1NCHS_OPA1NCH_POSN                    equ 0000h
OPA1NCHS_OPA1NCH_POSITION                equ 0000h
OPA1NCHS_OPA1NCH_SIZE                    equ 0008h
OPA1NCHS_OPA1NCH_LENGTH                  equ 0008h
OPA1NCHS_OPA1NCH_MASK                    equ 00FFh

// Register: OPA1PCHS
#define OPA1PCHS OPA1PCHS
OPA1PCHS                                 equ 0510h
// bitfield definitions
OPA1PCHS_PCH_POSN                        equ 0000h
OPA1PCHS_PCH_POSITION                    equ 0000h
OPA1PCHS_PCH_SIZE                        equ 0008h
OPA1PCHS_PCH_LENGTH                      equ 0008h
OPA1PCHS_PCH_MASK                        equ 00FFh
OPA1PCHS_OPA1PCH_POSN                    equ 0000h
OPA1PCHS_OPA1PCH_POSITION                equ 0000h
OPA1PCHS_OPA1PCH_SIZE                    equ 0008h
OPA1PCHS_OPA1PCH_LENGTH                  equ 0008h
OPA1PCHS_OPA1PCH_MASK                    equ 00FFh

