GopalSaraf/Practicals/PSDL/include/proc/pic16f1769.inc
// Register: MD1CLPPS
#define MD1CLPPS MD1CLPPS
MD1CLPPS                                 equ 0E31h
// bitfield definitions
MD1CLPPS_MD1CLPPS_POSN                   equ 0000h
MD1CLPPS_MD1CLPPS_POSITION               equ 0000h
MD1CLPPS_MD1CLPPS_SIZE                   equ 0005h
MD1CLPPS_MD1CLPPS_LENGTH                 equ 0005h
MD1CLPPS_MD1CLPPS_MASK                   equ 001Fh

// Register: MD1MODPPS
#define MD1MODPPS MD1MODPPS
MD1MODPPS                                equ 0E32h
// bitfield definitions
MD1MODPPS_MD1MODPPS_POSN                 equ 0000h
MD1MODPPS_MD1MODPPS_POSITION             equ 0000h
MD1MODPPS_MD1MODPPS_SIZE                 equ 0005h
MD1MODPPS_MD1MODPPS_LENGTH               equ 0005h
MD1MODPPS_MD1MODPPS_MASK                 equ 001Fh

// Register: MD2CHPPS
#define MD2CHPPS MD2CHPPS
MD2CHPPS                                 equ 0E33h
// bitfield definitions
MD2CHPPS_MD2CHPPS_POSN                   equ 0000h
MD2CHPPS_MD2CHPPS_POSITION               equ 0000h
MD2CHPPS_MD2CHPPS_SIZE                   equ 0005h
MD2CHPPS_MD2CHPPS_LENGTH                 equ 0005h
MD2CHPPS_MD2CHPPS_MASK                   equ 001Fh

// Register: MD2CLPPS
#define MD2CLPPS MD2CLPPS
MD2CLPPS                                 equ 0E34h
// bitfield definitions
MD2CLPPS_MD2CLPPS_POSN                   equ 0000h
MD2CLPPS_MD2CLPPS_POSITION               equ 0000h
MD2CLPPS_MD2CLPPS_SIZE                   equ 0005h
MD2CLPPS_MD2CLPPS_LENGTH                 equ 0005h
MD2CLPPS_MD2CLPPS_MASK                   equ 001Fh

// Register: MD2MODPPS
#define MD2MODPPS MD2MODPPS
MD2MODPPS                                equ 0E35h
// bitfield definitions
MD2MODPPS_MD2MODPPS_POSN                 equ 0000h
MD2MODPPS_MD2MODPPS_POSITION             equ 0000h
MD2MODPPS_MD2MODPPS_SIZE                 equ 0005h
MD2MODPPS_MD2MODPPS_LENGTH               equ 0005h
MD2MODPPS_MD2MODPPS_MASK                 equ 001Fh

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0E90h
// bitfield definitions
RA0PPS_RA0PPS_POSN                       equ 0000h
RA0PPS_RA0PPS_POSITION                   equ 0000h
RA0PPS_RA0PPS_SIZE                       equ 0005h
RA0PPS_RA0PPS_LENGTH                     equ 0005h
RA0PPS_RA0PPS_MASK                       equ 001Fh

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0E91h
// bitfield definitions
RA1PPS_RA1PPS_POSN                       equ 0000h
RA1PPS_RA1PPS_POSITION                   equ 0000h
RA1PPS_RA1PPS_SIZE                       equ 0005h
RA1PPS_RA1PPS_LENGTH                     equ 0005h
RA1PPS_RA1PPS_MASK                       equ 001Fh

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0E92h
// bitfield definitions
RA2PPS_RA2PPS_POSN                       equ 0000h
RA2PPS_RA2PPS_POSITION                   equ 0000h
RA2PPS_RA2PPS_SIZE                       equ 0005h
RA2PPS_RA2PPS_LENGTH                     equ 0005h
RA2PPS_RA2PPS_MASK                       equ 001Fh

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 0E94h
// bitfield definitions
RA4PPS_RA4PPS_POSN                       equ 0000h
RA4PPS_RA4PPS_POSITION                   equ 0000h
RA4PPS_RA4PPS_SIZE                       equ 0005h
RA4PPS_RA4PPS_LENGTH                     equ 0005h
RA4PPS_RA4PPS_MASK                       equ 001Fh

// Register: RA5PPS
#define RA5PPS RA5PPS
RA5PPS                                   equ 0E95h
// bitfield definitions
RA5PPS_RA5PPS_POSN                       equ 0000h
RA5PPS_RA5PPS_POSITION                   equ 0000h
RA5PPS_RA5PPS_SIZE                       equ 0005h
RA5PPS_RA5PPS_LENGTH                     equ 0005h
RA5PPS_RA5PPS_MASK                       equ 001Fh

// Register: RB4PPS
#define RB4PPS RB4PPS
RB4PPS                                   equ 0E9Ch
// bitfield definitions
RB4PPS_RB4PPS_POSN                       equ 0000h
RB4PPS_RB4PPS_POSITION                   equ 0000h
RB4PPS_RB4PPS_SIZE                       equ 0005h
RB4PPS_RB4PPS_LENGTH                     equ 0005h
RB4PPS_RB4PPS_MASK                       equ 001Fh

// Register: RB5PPS
#define RB5PPS RB5PPS
RB5PPS                                   equ 0E9Dh
// bitfield definitions
RB5PPS_RB5PPS_POSN                       equ 0000h
RB5PPS_RB5PPS_POSITION                   equ 0000h
RB5PPS_RB5PPS_SIZE                       equ 0005h
RB5PPS_RB5PPS_LENGTH                     equ 0005h
RB5PPS_RB5PPS_MASK                       equ 001Fh

// Register: RB6PPS
#define RB6PPS RB6PPS
RB6PPS                                   equ 0E9Eh
// bitfield definitions
RB6PPS_RB6PPS_POSN                       equ 0000h
RB6PPS_RB6PPS_POSITION                   equ 0000h
RB6PPS_RB6PPS_SIZE                       equ 0005h
RB6PPS_RB6PPS_LENGTH                     equ 0005h
RB6PPS_RB6PPS_MASK                       equ 001Fh

// Register: RB7PPS
#define RB7PPS RB7PPS
RB7PPS                                   equ 0E9Fh
// bitfield definitions
RB7PPS_RB7PPS_POSN                       equ 0000h
RB7PPS_RB7PPS_POSITION                   equ 0000h
RB7PPS_RB7PPS_SIZE                       equ 0005h
RB7PPS_RB7PPS_LENGTH                     equ 0005h
RB7PPS_RB7PPS_MASK                       equ 001Fh

// Register: RC0PPS
#define RC0PPS RC0PPS
RC0PPS                                   equ 0EA0h
// bitfield definitions
RC0PPS_RC0PPS_POSN                       equ 0000h
RC0PPS_RC0PPS_POSITION                   equ 0000h
RC0PPS_RC0PPS_SIZE                       equ 0005h
RC0PPS_RC0PPS_LENGTH                     equ 0005h
RC0PPS_RC0PPS_MASK                       equ 001Fh

// Register: RC1PPS
#define RC1PPS RC1PPS
RC1PPS                                   equ 0EA1h
// bitfield definitions
RC1PPS_RC1PPS_POSN                       equ 0000h
RC1PPS_RC1PPS_POSITION                   equ 0000h
RC1PPS_RC1PPS_SIZE                       equ 0005h
RC1PPS_RC1PPS_LENGTH                     equ 0005h
RC1PPS_RC1PPS_MASK                       equ 001Fh

// Register: RC2PPS
#define RC2PPS RC2PPS
RC2PPS                                   equ 0EA2h
// bitfield definitions
RC2PPS_RC2PPS_POSN                       equ 0000h
RC2PPS_RC2PPS_POSITION                   equ 0000h
RC2PPS_RC2PPS_SIZE                       equ 0005h
RC2PPS_RC2PPS_LENGTH                     equ 0005h
RC2PPS_RC2PPS_MASK                       equ 001Fh

