GopalSaraf/Practicals/PSDL/include/proc/pic16f1769.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ACKDT                            BANKMASK(SSP1CON2), 5
#define ACKEN                            BANKMASK(SSP1CON2), 4
#define ACKSTAT                          BANKMASK(SSP1CON2), 6
#define ACKTIM                           BANKMASK(SSP1CON3), 7
#define ADD0                             BANKMASK(SSP1ADD), 0
#define ADD1                             BANKMASK(SSP1ADD), 1
#define ADD2                             BANKMASK(SSP1ADD), 2
#define ADD3                             BANKMASK(SSP1ADD), 3
#define ADD4                             BANKMASK(SSP1ADD), 4
#define ADD5                             BANKMASK(SSP1ADD), 5
#define ADD6                             BANKMASK(SSP1ADD), 6
#define ADD7                             BANKMASK(SSP1ADD), 7
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADNREF                           BANKMASK(ADCON1), 2
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define AHEN                             BANKMASK(SSP1CON3), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define BCL1IE                           BANKMASK(PIE2), 3
#define BCL1IF                           BANKMASK(PIR2), 3
#define BF                               BANKMASK(SSP1STAT), 0
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BUF0                             BANKMASK(SSP1BUF), 0
#define BUF1                             BANKMASK(SSP1BUF), 1
#define BUF2                             BANKMASK(SSP1BUF), 2
#define BUF3                             BANKMASK(SSP1BUF), 3
#define BUF4                             BANKMASK(SSP1BUF), 4
#define BUF5                             BANKMASK(SSP1BUF), 5
#define BUF6                             BANKMASK(SSP1BUF), 6
#define BUF7                             BANKMASK(SSP1BUF), 7
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NSEL), 0
#define C1NCH1                           BANKMASK(CM1NSEL), 1
#define C1NCH2                           BANKMASK(CM1NSEL), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1PSEL), 0
#define C1PCH1                           BANKMASK(CM1PSEL), 1
#define C1PCH2                           BANKMASK(CM1PSEL), 2
#define C1PCH3                           BANKMASK(CM1PSEL), 3
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS), 0
#define C1TSEL1                          BANKMASK(CCPTMRS), 1
#define C1ZLF                            BANKMASK(CM1CON0), 3
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NSEL), 0
#define C2NCH1                           BANKMASK(CM2NSEL), 1
#define C2NCH2                           BANKMASK(CM2NSEL), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2PSEL), 0
#define C2PCH1                           BANKMASK(CM2PSEL), 1
#define C2PCH2                           BANKMASK(CM2PSEL), 2
#define C2PCH3                           BANKMASK(CM2PSEL), 3
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS), 2
#define C2TSEL1                          BANKMASK(CCPTMRS), 3
#define C2ZLF                            BANKMASK(CM2CON0), 3
#define C3HYS                            BANKMASK(CM3CON0), 1
#define C3IE                             BANKMASK(PIE2), 1
#define C3IF                             BANKMASK(PIR2), 1
#define C3INTN                           BANKMASK(CM3CON1), 0
#define C3INTP                           BANKMASK(CM3CON1), 1
#define C3NCH0                           BANKMASK(CM3NSEL), 0
#define C3NCH1                           BANKMASK(CM3NSEL), 1
#define C3NCH2                           BANKMASK(CM3NSEL), 2
#define C3ON                             BANKMASK(CM3CON0), 7
#define C3OUT                            BANKMASK(CM3CON0), 6
#define C3PCH0                           BANKMASK(CM3PSEL), 0
#define C3PCH1                           BANKMASK(CM3PSEL), 1
#define C3PCH2                           BANKMASK(CM3PSEL), 2
#define C3PCH3                           BANKMASK(CM3PSEL), 3
#define C3POL                            BANKMASK(CM3CON0), 4
#define C3SP                             BANKMASK(CM3CON0), 2
#define C3SYNC                           BANKMASK(CM3CON0), 0
#define C3ZLF                            BANKMASK(CM3CON0), 3
#define C4HYS                            BANKMASK(CM4CON0), 1
#define C4IE                             BANKMASK(PIE2), 2
#define C4IF                             BANKMASK(PIR2), 2
#define C4INTN                           BANKMASK(CM4CON1), 0
#define C4INTP                           BANKMASK(CM4CON1), 1
#define C4NCH0                           BANKMASK(CM4NSEL), 0
#define C4NCH1                           BANKMASK(CM4NSEL), 1
#define C4NCH2                           BANKMASK(CM4NSEL), 2
#define C4ON                             BANKMASK(CM4CON0), 7
#define C4OUT                            BANKMASK(CM4CON0), 6
#define C4PCH0                           BANKMASK(CM4PSEL), 0
#define C4PCH1                           BANKMASK(CM4PSEL), 1
#define C4PCH2                           BANKMASK(CM4PSEL), 2
#define C4PCH3                           BANKMASK(CM4PSEL), 3
#define C4POL                            BANKMASK(CM4CON0), 4
#define C4SP                             BANKMASK(CM4CON0), 2
#define C4SYNC                           BANKMASK(CM4CON0), 0
#define C4ZLF                            BANKMASK(CM4CON0), 3
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCPIE                            BANKMASK(PIE1), 2
#define CCPIF                            BANKMASK(PIR1), 2
#define CFGS                             BANKMASK(PMCON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CLC1IE                           BANKMASK(PIE3), 0
#define CLC1IF                           BANKMASK(PIR3), 0
#define CLC2IE                           BANKMASK(PIE3), 1
#define CLC2IF                           BANKMASK(PIR3), 1
#define CLC3IE                           BANKMASK(PIE3), 2
#define CLC3IF                           BANKMASK(PIR3), 2
#define COG1IF                           BANKMASK(PIR3), 5
#define COG2IE                           BANKMASK(PIE3), 3
#define COG2IF                           BANKMASK(PIR3), 3
#define COGIE                            BANKMASK(PIE3), 5
#define CREN                             BANKMASK(RC1STA), 4
#define CSRC                             BANKMASK(TX1STA), 7
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1FM                           BANKMASK(DAC1CON0), 6
#define DAC1LD                           BANKMASK(DACLD), 0
#define DAC1NSS0                         BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1REFL), 0
#define DAC1R1                           BANKMASK(DAC1REFL), 1
#define DAC1R10                          BANKMASK(DAC1REFH), 2
#define DAC1R11                          BANKMASK(DAC1REFH), 3
#define DAC1R12                          BANKMASK(DAC1REFH), 4
#define DAC1R13                          BANKMASK(DAC1REFH), 5
#define DAC1R14                          BANKMASK(DAC1REFH), 6
#define DAC1R15                          BANKMASK(DAC1REFH), 7
#define DAC1R2                           BANKMASK(DAC1REFL), 2
#define DAC1R3                           BANKMASK(DAC1REFL), 3
#define DAC1R4                           BANKMASK(DAC1REFL), 4
#define DAC1R5                           BANKMASK(DAC1REFL), 5
#define DAC1R6                           BANKMASK(DAC1REFL), 6
#define DAC1R7                           BANKMASK(DAC1REFL), 7
#define DAC1R8                           BANKMASK(DAC1REFH), 0
#define DAC1R9                           BANKMASK(DAC1REFH), 1
#define DAC1REF0                         BANKMASK(DAC1REFL), 0
#define DAC1REF1                         BANKMASK(DAC1REFL), 1
#define DAC1REF10                        BANKMASK(DAC1REFH), 2
#define DAC1REF11                        BANKMASK(DAC1REFH), 3
#define DAC1REF12                        BANKMASK(DAC1REFH), 4
#define DAC1REF13                        BANKMASK(DAC1REFH), 5
#define DAC1REF14                        BANKMASK(DAC1REFH), 6
#define DAC1REF15                        BANKMASK(DAC1REFH), 7
#define DAC1REF2                         BANKMASK(DAC1REFL), 2
#define DAC1REF3                         BANKMASK(DAC1REFL), 3
#define DAC1REF4                         BANKMASK(DAC1REFL), 4
#define DAC1REF5                         BANKMASK(DAC1REFL), 5
#define DAC1REF6                         BANKMASK(DAC1REFL), 6
#define DAC1REF7                         BANKMASK(DAC1REFL), 7
#define DAC1REF8                         BANKMASK(DAC1REFH), 0
#define DAC1REF9                         BANKMASK(DAC1REFH), 1
#define DAC2EN                           BANKMASK(DAC2CON0), 7
#define DAC2FM                           BANKMASK(DAC2CON0), 6
#define DAC2LD                           BANKMASK(DACLD), 1
#define DAC2NSS0                         BANKMASK(DAC2CON0), 0
#define DAC2OE1                          BANKMASK(DAC2CON0), 5
#define DAC2PSS0                         BANKMASK(DAC2CON0), 2
#define DAC2PSS1                         BANKMASK(DAC2CON0), 3
#define DAC2R0                           BANKMASK(DAC2REFL), 0
#define DAC2R1                           BANKMASK(DAC2REFL), 1
#define DAC2R10                          BANKMASK(DAC2REFH), 2
#define DAC2R11                          BANKMASK(DAC2REFH), 3
#define DAC2R12                          BANKMASK(DAC2REFH), 4
#define DAC2R13                          BANKMASK(DAC2REFH), 5
#define DAC2R14                          BANKMASK(DAC2REFH), 6
#define DAC2R15                          BANKMASK(DAC2REFH), 7
#define DAC2R2                           BANKMASK(DAC2REFL), 2
#define DAC2R3                           BANKMASK(DAC2REFL), 3
#define DAC2R4                           BANKMASK(DAC2REFL), 4
#define DAC2R5                           BANKMASK(DAC2REFL), 5
#define DAC2R6                           BANKMASK(DAC2REFL), 6
#define DAC2R7                           BANKMASK(DAC2REFL), 7
#define DAC2R8                           BANKMASK(DAC2REFH), 0
#define DAC2R9                           BANKMASK(DAC2REFH), 1
#define DAC2REF0                         BANKMASK(DAC2REFL), 0
#define DAC2REF1                         BANKMASK(DAC2REFL), 1
#define DAC2REF10                        BANKMASK(DAC2REFH), 2
#define DAC2REF11                        BANKMASK(DAC2REFH), 3
#define DAC2REF12                        BANKMASK(DAC2REFH), 4
#define DAC2REF13                        BANKMASK(DAC2REFH), 5
#define DAC2REF14                        BANKMASK(DAC2REFH), 6
#define DAC2REF15                        BANKMASK(DAC2REFH), 7
#define DAC2REF2                         BANKMASK(DAC2REFL), 2
#define DAC2REF3                         BANKMASK(DAC2REFL), 3
#define DAC2REF4                         BANKMASK(DAC2REFL), 4
#define DAC2REF5                         BANKMASK(DAC2REFL), 5
#define DAC2REF6                         BANKMASK(DAC2REFL), 6
#define DAC2REF7                         BANKMASK(DAC2REFL), 7
#define DAC2REF8                         BANKMASK(DAC2REFH), 0
#define DAC2REF9                         BANKMASK(DAC2REFH), 1
#define DAC3EN                           BANKMASK(DAC3CON0), 7
#define DAC3NSS                          BANKMASK(DAC3CON0), 0
#define DAC3OE1                          BANKMASK(DAC3CON0), 5
#define DAC3PSS0                         BANKMASK(DAC3CON0), 2
#define DAC3PSS1                         BANKMASK(DAC3CON0), 3
#define DAC3R0                           BANKMASK(DAC3REF), 0
#define DAC3R1                           BANKMASK(DAC3REF), 1
#define DAC3R2                           BANKMASK(DAC3REF), 2
#define DAC3R3                           BANKMASK(DAC3REF), 3
#define DAC3R4                           BANKMASK(DAC3REF), 4
#define DAC3REF0                         BANKMASK(DAC3REF), 0
#define DAC3REF1                         BANKMASK(DAC3REF), 1
#define DAC3REF2                         BANKMASK(DAC3REF), 2
#define DAC3REF3                         BANKMASK(DAC3REF), 3
#define DAC3REF4                         BANKMASK(DAC3REF), 4
#define DAC3REF5                         BANKMASK(DAC3REF), 5
#define DAC4EN                           BANKMASK(DAC4CON0), 7
#define DAC4NSS                          BANKMASK(DAC4CON0), 0
#define DAC4OE1                          BANKMASK(DAC4CON0), 5
#define DAC4PSS0                         BANKMASK(DAC4CON0), 2
#define DAC4PSS1                         BANKMASK(DAC4CON0), 3
#define DAC4R0                           BANKMASK(DAC4REF), 0
#define DAC4R1                           BANKMASK(DAC4REF), 1
#define DAC4R2                           BANKMASK(DAC4REF), 2
#define DAC4R3                           BANKMASK(DAC4REF), 3
#define DAC4R4                           BANKMASK(DAC4REF), 4
#define DAC4REF0                         BANKMASK(DAC4REF), 0
#define DAC4REF1                         BANKMASK(DAC4REF), 1
#define DAC4REF2                         BANKMASK(DAC4REF), 2
#define DAC4REF3                         BANKMASK(DAC4REF), 3
#define DAC4REF4                         BANKMASK(DAC4REF), 4
#define DAC4REF5                         BANKMASK(DAC4REF), 5
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define D_nA                             BANKMASK(SSP1STAT), 5
#define FERR                             BANKMASK(RC1STA), 2
#define FREE                             BANKMASK(PMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1ARSEN                          BANKMASK(COG1ASD0), 6
#define G1AS0E                           BANKMASK(COG1ASD1), 0
#define G1AS1E                           BANKMASK(COG1ASD1), 1
#define G1AS2E                           BANKMASK(COG1ASD1), 2
#define G1AS3E                           BANKMASK(COG1ASD1), 3
#define G1AS4E                           BANKMASK(COG1ASD1), 4
#define G1AS5E                           BANKMASK(COG1ASD1), 5
#define G1AS6E                           BANKMASK(COG1ASD1), 6
#define G1AS7E                           BANKMASK(COG1ASD1), 7
#define G1ASDAC0                         BANKMASK(COG1ASD0), 2
#define G1ASDAC1                         BANKMASK(COG1ASD0), 3
#define G1ASDBD0                         BANKMASK(COG1ASD0), 4
#define G1ASDBD1                         BANKMASK(COG1ASD0), 5
#define G1ASE                            BANKMASK(COG1ASD0), 7
#define G1ASREN                          BANKMASK(COG1ASD0), 6
#define G1BLKF0                          BANKMASK(COG1BLKF), 0
#define G1BLKF1                          BANKMASK(COG1BLKF), 1
#define G1BLKF2                          BANKMASK(COG1BLKF), 2
#define G1BLKF3                          BANKMASK(COG1BLKF), 3
#define G1BLKF4                          BANKMASK(COG1BLKF), 4
#define G1BLKF5                          BANKMASK(COG1BLKF), 5
#define G1BLKR0                          BANKMASK(COG1BLKR), 0
#define G1BLKR1                          BANKMASK(COG1BLKR), 1
#define G1BLKR2                          BANKMASK(COG1BLKR), 2
#define G1BLKR3                          BANKMASK(COG1BLKR), 3
#define G1BLKR4                          BANKMASK(COG1BLKR), 4
#define G1BLKR5                          BANKMASK(COG1BLKR), 5
#define G1CS0                            BANKMASK(COG1CON0), 3
#define G1CS1                            BANKMASK(COG1CON0), 4
#define G1DBF0                           BANKMASK(COG1DBF), 0
#define G1DBF1                           BANKMASK(COG1DBF), 1
#define G1DBF2                           BANKMASK(COG1DBF), 2
#define G1DBF3                           BANKMASK(COG1DBF), 3
#define G1DBF4                           BANKMASK(COG1DBF), 4
#define G1DBF5                           BANKMASK(COG1DBF), 5
#define G1DBR0                           BANKMASK(COG1DBR), 0
#define G1DBR1                           BANKMASK(COG1DBR), 1
#define G1DBR2                           BANKMASK(COG1DBR), 2
#define G1DBR3                           BANKMASK(COG1DBR), 3
#define G1DBR4                           BANKMASK(COG1DBR), 4
#define G1DBR5                           BANKMASK(COG1DBR), 5
#define G1EN                             BANKMASK(COG1CON0), 7
#define G1FDBS                           BANKMASK(COG1CON1), 6
#define G1FIS0                           BANKMASK(COG1FIS0), 0
#define G1FIS1                           BANKMASK(COG1FIS0), 1
#define G1FIS10                          BANKMASK(COG1FIS1), 2
#define G1FIS11                          BANKMASK(COG1FIS1), 3
#define G1FIS12                          BANKMASK(COG1FIS1), 4
#define G1FIS13                          BANKMASK(COG1FIS1), 5
#define G1FIS14                          BANKMASK(COG1FIS1), 6
#define G1FIS15                          BANKMASK(COG1FIS1), 7
#define G1FIS2                           BANKMASK(COG1FIS0), 2
#define G1FIS3                           BANKMASK(COG1FIS0), 3
#define G1FIS4                           BANKMASK(COG1FIS0), 4
#define G1FIS5                           BANKMASK(COG1FIS0), 5
#define G1FIS6                           BANKMASK(COG1FIS0), 6
#define G1FIS7                           BANKMASK(COG1FIS0), 7
#define G1FIS8                           BANKMASK(COG1FIS1), 0
#define G1FIS9                           BANKMASK(COG1FIS1), 1
#define G1FSIM0                          BANKMASK(COG1FSIM0), 0
#define G1FSIM1                          BANKMASK(COG1FSIM0), 1
#define G1FSIM10                         BANKMASK(COG1FSIM1), 2
#define G1FSIM11                         BANKMASK(COG1FSIM1), 3
#define G1FSIM12                         BANKMASK(COG1FSIM1), 4
#define G1FSIM13                         BANKMASK(COG1FSIM1), 5
#define G1FSIM14                         BANKMASK(COG1FSIM1), 6
#define G1FSIM15                         BANKMASK(COG1FSIM1), 7
#define G1FSIM2                          BANKMASK(COG1FSIM0), 2
#define G1FSIM3                          BANKMASK(COG1FSIM0), 3
#define G1FSIM4                          BANKMASK(COG1FSIM0), 4
#define G1FSIM5                          BANKMASK(COG1FSIM0), 5
